Tekla Open API Reference for Tekla Structures 2025
TagLocation Enumeration
 The mark tag location values.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum TagLocation
Public Enumeration TagLocation
Members
Member name | Value | Description
AboveLine | 1 |  The mark tag is above the line.
BelowLine | 2 |  The mark tag is below the line.
MiddleLevelOfSymbol | 3 |  The mark tag is in the middle level of the mark symbol.
AboveSymbolCenterLine | 4 |  The mark tag is above the center line of the mark symbol.
BelowSymbolCenterLine | 5 |  The mark tag is below the center line of the mark symbol.
CustomRelativeToSymbol | 6 |  The mark tag is in a custom location relative to the mark symbol.
See Also
Reference
Tekla.Structures.Drawing Namespace